Revit 2027 API
BuiltInFailures.StairRampFailures.StairsAutomaticLandingLayoutWarn Property
 Fail to generate the automatic landing layout
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsAutomaticLandingLayoutWarn { get; }
Public Shared ReadOnly Property StairsAutomaticLandingLayoutWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsAutomaticLandingLayoutWarn {
	FailureDefinitionId^ get ();
}
static member StairsAutomaticLandingLayoutWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace